Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/motor_carbon_other_taxes/carbon_tax.html.txt.tmx
Source language: en
Languages: ga

source: In 2010 a carbon tax was introduced in Ireland
ga: Tugadh cáin charbóin isteach in Éirinn in 2010

source: The carbon tax applies to kerosene, marked gas oil, liquid petroleum gas, fuel oil, natural gas and solid fuels
ga: Baineann an cháin charbóin le ceirisín, ola mharcáilte gháis, gás peitriliam leachtaithe, ola bhreosla agus le gás nádúrtha

source: The rate of tax on solid fuels from 1 May 2013 to 1 May 2014 was based on a charge of €10 per tonne of CO2 emitted by the fuel concerned
ga: Méadaíodh an cháin charbóin i mBuiséad 2012 ó €5 go dtí €20 an tonna CO2 a astaítear ó bhreoslaí iontaise

source: The rate increased to €20 per tonne with effect from 1 May 2014
ga: Téann an méadú i bhfeidhm ar pheitreal agus ar dhíosal do ghluaisteáin ó mheán oíche, an 6 Nollaig 2011

source: Read more about solid fuel carbon tax
ga: Is féidir leat rátaí reatha na gcánacha carbóin a fháil ó na Coimisinéirí Ioncaim (pdf)
